# GetFromDocument Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyDataSettings..::..GetFromDocument Method
EnergyDataSettings Class See Also
---
Every project document has a EnergyDataSettings element. Family documents do not have EnergyDataSettings elements.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public static EnergyDataSettings GetFromDocument(
	Document cda
)
```

Visual Basic
---
```text
Public Shared Function GetFromDocument ( _
	cda As Document _
) As EnergyDataSettings
```

Visual C++
---
```text
public:
static EnergyDataSettings^ GetFromDocument(
	Document^ cda
)
```

# ### Parameters
cda
    Type: Autodesk.Revit.DB..::..Document The document.
# ### Return Value
Returns the EnergyDataSettings element or NULL.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace